hw2_rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index

    @sort = params[:sort] || session[:sort]
    @ratings = params[:ratings] || session[:ratings]
    @all_ratings = Movie.all_ratings
    @selected_ratings = @ratings.nil? ? @all_ratings : @ratings.keys
    @movies = Movie.order(@sort).find_all_by_rating(@selected_ratings)